Revit 2027 API
Transform.ScaleBasisAndOrigin Method
Scales the basis vectors and the origin of this transformation and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform ScaleBasisAndOrigin(
	double scale
)
Public Function ScaleBasisAndOrigin (
	scale As Double
) As Transform
public:
Transform^ ScaleBasisAndOrigin(
	double scale
)
member ScaleBasisAndOrigin :
        scale : float -> Transform
Parameters
scale Double
The scale value.
Return Value
Transform
The transformation equal to the composition of the two transformations.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the specified value is an infinite number.
Remarks
 The resulting transformation is equivalent to the application of this transformation and then the uniform scale, in this order.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace